{
   "title": "The work, which becomes a new genre itself, will be called... COWBOY BEBOP",
   "description": "My entry for the second installment of the WebJam | made by Igor Bedesqui",


   "heroTitle" : "The work, which becomes a new genre itself, will be called... <b>COWBOY BEBOP</b> ",

   "01Thin": "Why?",
   "01Copy": "I made this project as an entry for the second installment of the <hc><s>WebJam</s></hc>.  <br/><br/>The challenge for this WebJam was to create a single page/non-scrollable site for a movie of my choosing. The site should work on any screen size and illustrate the movie.",
   "webjamHc": "The <b>WebJam</b> is a hackathon where the participants try to create a website following a prompt and some rules", 

   "02Thin": "Design",
   "02Copy": "My choice of movie was Cowboy Bebop, it's one of my favorites and screams personality with its artwork. The mix between Jazz, Noir, Western, and Space is unique and serves as a great source of inspiration for a website. <br/><br/>The main constraint for this exercise was space. I took inspiration from types of media with the same limitation such as posters, cover arts, and the TV show itself. After spending an uncomfortable amount of time rewatching the opening of Cowboy Bebop, I figured that I needed to include the iconic shots of silhouettes against bright-colored backgrounds. I even found one of the pieces that inspired the show's artists: the cover art for the film \"Tokyo Drifter\". <br/>At this point, I knew that I wanted something that could be mistaken for a poster when showing it to someone. I made a quick sketch on a piece of paper from my desk and started working.",

   "03Thin": "Development",
   "03Copy": "Trying to avoid unnecessary complexity, I approached this project from a minimalist perspective, I created a plain HTML file with tailwindcss and made a responsive design with two major blocks, one for the text content and the other for the silhouette; In the second one, I took inspiration from the show's opening where we can find bits of a paragraph overlayed on the solid color to tell a history ending with the ambitious phrase that gives title to the website: \"The work, which becomes a new genre itself, will be called... COWBOY BEBOP\".<br/><br/>It became clear that I would need to create media for this piece. I downloaded Adobe Illustrator for the first time in a couple of years to make figures to layer on my scene. Even though my initial plan to use the silhouette as a \"mask\" that contained the animated spaceship didn't work, I got the vibe I wanted by using a clip-path element to clip an image of stars I modified into the silhouette. Adding a simple animation to the smoke SVG and a trail to the otherwise boring spaceship gave life to this otherwise static poster.<br/><br/>For the final touches, I allowed the title to break its box and overlap with the silhouette container creating that bit of spice the piece was missing. To add to the poster-like feeling I was going for, I added an image of wrinkled paper as an overlay with a CSS filter to make the entire thing look like something you would find glued to a wall and voilá.",


   "04Thin": "Results",
   "04IntroCopy": "You can see the website <a>clicking here</a>.<br/> or looking at some screenshots:",
   "04Copy": "After working on this project I'm more confident in my ability to create a cool design and translate it to code. As well as working with design tools such as Adobe Illustrator and Photoshop when needed. I also had a chance to learn a new animation library called motion one and enjoyed every second of it.<br/><br/>I liked the WebJam experience and will be looking forward to its future installments."

}